VDowbensky/efr32_baremetal/baremetal_test/device/efr32fg1v_protimer.h
/***************************************************************************//**
 * @file
 * @brief EFR32FG1V_CRC register and bit field definitions
 *******************************************************************************
 * # License
 * <b>Copyright 2020 Silicon Laboratories Inc. www.silabs.com</b>
 *******************************************************************************
 *
 * SPDX-License-Identifier: Zlib
 *
 * The licensor of this software is Silicon Laboratories Inc.
 *
 * This software is provided 'as-is', without any express or implied
 * warranty. In no event will the authors be held liable for any damages
 * arising from the use of this software.
 *
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software
 *    in a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 *
 ******************************************************************************/

#if defined(__ICCARM__)
#pragma system_include       /* Treat file as system include file. */
#elif defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
#pragma clang system_header  /* Treat file as system include file. */
#endif

/***************************************************************************//**
 * @addtogroup Parts
 * @{
 ******************************************************************************/
/***************************************************************************//**
 * @defgroup EFR32FG1V_PROTIMER
 * @{
 * @brief EFR32FG1V_PROTIMER Register Declaration
 ******************************************************************************/
/* =========================================================================================================================== */
/* ================                                         PROTIMER                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief PROTIMER (PROTIMER)
  */

typedef struct {                                /*!< (@ 0x40085000) PROTIMER Structure                                         */
  __IOM uint32_t  CTRL;                         /*!< (@ 0x00000000) CTRL                                                       */
  __IOM uint32_t  CMD;                          /*!< (@ 0x00000004) CMD                                                        */
  __IOM uint32_t  PRSCTRL;                      /*!< (@ 0x00000008) PRSCTRL                                                    */
  __IOM uint32_t  STATUS;                       /*!< (@ 0x0000000C) STATUS                                                     */
  __IOM uint32_t  PRECNT;                       /*!< (@ 0x00000010) PRECNT                                                     */
  __IOM uint32_t  BASECNT;                      /*!< (@ 0x00000014) BASECNT                                                    */
  __IOM uint32_t  WRAPCNT;                      /*!< (@ 0x00000018) WRAPCNT                                                    */
  __IOM uint32_t  BASEPRE;                      /*!< (@ 0x0000001C) BASEPRE                                                    */
  __IOM uint32_t  LWRAPCNT;                     /*!< (@ 0x00000020) LWRAPCNT                                                   */
  __IOM uint32_t  PRECNTTOPADJ;                 /*!< (@ 0x00000024) PRECNTTOPADJ                                               */
  __IOM uint32_t  PRECNTTOP;                    /*!< (@ 0x00000028) PRECNTTOP                                                  */
  __IOM uint32_t  BASECNTTOP;                   /*!< (@ 0x0000002C) BASECNTTOP                                                 */
  __IOM uint32_t  WRAPCNTTOP;                   /*!< (@ 0x00000030) WRAPCNTTOP                                                 */
  __IOM uint32_t  TOUT0CNT;                     /*!< (@ 0x00000034) TOUT0CNT                                                   */
  __IOM uint32_t  TOUT0CNTTOP;                  /*!< (@ 0x00000038) TOUT0CNTTOP                                                */
  __IOM uint32_t  TOUT0COMP;                    /*!< (@ 0x0000003C) TOUT0COMP                                                  */
  __IOM uint32_t  TOUT1CNT;                     /*!< (@ 0x00000040) TOUT1CNT                                                   */
  __IOM uint32_t  TOUT1CNTTOP;                  /*!< (@ 0x00000044) TOUT1CNTTOP                                                */
  __IOM uint32_t  TOUT1COMP;                    /*!< (@ 0x00000048) TOUT1COMP                                                  */
  __IOM uint32_t  LBTCTRL;                      /*!< (@ 0x0000004C) LBTCTRL                                                    */
  __IOM uint32_t  LBTPRSCTRL;                   /*!< (@ 0x00000050) LBTPRSCTRL                                                 */
  __IOM uint32_t  LBTSTATE;                     /*!< (@ 0x00000054) LBTSTATE                                                   */
  __IOM uint32_t  RANDOM;                       /*!< (@ 0x00000058) RANDOM                                                     */
  __IOM uint32_t  IF;                           /*!< (@ 0x0000005C) IF                                                         */
  __IOM uint32_t  IFS;                          /*!< (@ 0x00000060) IFS                                                        */
  __IOM uint32_t  IFC;                          /*!< (@ 0x00000064) IFC                                                        */
  __IOM uint32_t  IEN;                          /*!< (@ 0x00000068) IEN                                                        */
  __IOM uint32_t  RXCTRL;                       /*!< (@ 0x0000006C) RXCTRL                                                     */
  __IOM uint32_t  TXCTRL;                       /*!< (@ 0x00000070) TXCTRL                                                     */
  __IOM uint32_t  CC0_CTRL;                     /*!< (@ 0x00000074) CC0_CTRL                                                   */
  __IOM uint32_t  CC0_PRE;                      /*!< (@ 0x00000078) CC0_PRE                                                    */
  __IOM uint32_t  CC0_BASE;                     /*!< (@ 0x0000007C) CC0_BASE                                                   */
  __IOM uint32_t  CC0_WRAP;                     /*!< (@ 0x00000080) CC0_WRAP                                                   */
  __IOM uint32_t  CC1_CTRL;                     /*!< (@ 0x00000084) CC1_CTRL                                                   */
  __IOM uint32_t  CC1_PRE;                      /*!< (@ 0x00000088) CC1_PRE                                                    */
  __IOM uint32_t  CC1_BASE;                     /*!< (@ 0x0000008C) CC1_BASE                                                   */
  __IOM uint32_t  CC1_WRAP;                     /*!< (@ 0x00000090) CC1_WRAP                                                   */
  __IOM uint32_t  CC2_CTRL;                     /*!< (@ 0x00000094) CC2_CTRL                                                   */
  __IOM uint32_t  CC2_PRE;                      /*!< (@ 0x00000098) CC2_PRE                                                    */
  __IOM uint32_t  CC2_BASE;                     /*!< (@ 0x0000009C) CC2_BASE                                                   */
  __IOM uint32_t  CC2_WRAP;                     /*!< (@ 0x000000A0) CC2_WRAP                                                   */
  __IOM uint32_t  CC3_CTRL;                     /*!< (@ 0x000000A4) CC3_CTRL                                                   */
  __IOM uint32_t  CC3_PRE;                      /*!< (@ 0x000000A8) CC3_PRE                                                    */
  __IOM uint32_t  CC3_BASE;                     /*!< (@ 0x000000AC) CC3_BASE                                                   */
  __IOM uint32_t  CC3_WRAP;                     /*!< (@ 0x000000B0) CC3_WRAP                                                   */
  __IOM uint32_t  CC4_CTRL;                     /*!< (@ 0x000000B4) CC4_CTRL                                                   */
  __IOM uint32_t  CC4_PRE;                      /*!< (@ 0x000000B8) CC4_PRE                                                    */
  __IOM uint32_t  CC4_BASE;                     /*!< (@ 0x000000BC) CC4_BASE                                                   */
  __IOM uint32_t  CC4_WRAP;                     /*!< (@ 0x000000C0) CC4_WRAP                                                   */
} PROTIMER_Typedef;                                /*!< Size = 196 (0xc4)                                                         */
 
/***************************************************************************//**
 * @addtogroup EFR32FG1V_PROTIMER
 * @{
 * @defgroup EFR32FG1V_PROTIMER BitFields  PROTIMER Bit Fields
 * @{
 ******************************************************************************/
/* =========================================================================================================================== */
/* ================                                         PROTIMER                                          ================ */
/* =========================================================================================================================== */

