VDowbensky/efr32_baremetal/baremetal_test/device/efr32fg1v_protimer.h
/* =========================================================  CTRL  ========================================================== */
#define PROTIMER_CTRL_DEBUGRUN_Pos        (1UL)                     /*!< DEBUGRUN (Bit 1)                                      */
#define PROTIMER_CTRL_DEBUGRUN_Msk        (0x2UL)                   /*!< DEBUGRUN (Bitfield-Mask: 0x01)                        */
#define PROTIMER_CTRL_DMACLRACT_Pos       (2UL)                     /*!< DMACLRACT (Bit 2)                                     */
#define PROTIMER_CTRL_DMACLRACT_Msk       (0x4UL)                   /*!< DMACLRACT (Bitfield-Mask: 0x01)                       */
#define PROTIMER_CTRL_OSMEN_Pos           (4UL)                     /*!< OSMEN (Bit 4)                                         */
#define PROTIMER_CTRL_OSMEN_Msk           (0x10UL)                  /*!< OSMEN (Bitfield-Mask: 0x01)                           */
#define PROTIMER_CTRL_ZEROSTARTEN_Pos     (5UL)                     /*!< ZEROSTARTEN (Bit 5)                                   */
#define PROTIMER_CTRL_ZEROSTARTEN_Msk     (0x20UL)                  /*!< ZEROSTARTEN (Bitfield-Mask: 0x01)                     */
#define PROTIMER_CTRL_PRECNTSRC_Pos       (8UL)                     /*!< PRECNTSRC (Bit 8)                                     */
#define PROTIMER_CTRL_PRECNTSRC_Msk       (0x300UL)                 /*!< PRECNTSRC (Bitfield-Mask: 0x03)                       */
#define PROTIMER_CTRL_BASECNTSRC_Pos      (12UL)                    /*!< BASECNTSRC (Bit 12)                                   */
#define PROTIMER_CTRL_BASECNTSRC_Msk      (0x3000UL)                /*!< BASECNTSRC (Bitfield-Mask: 0x03)                      */
#define PROTIMER_CTRL_WRAPCNTSRC_Pos      (16UL)                    /*!< WRAPCNTSRC (Bit 16)                                   */
#define PROTIMER_CTRL_WRAPCNTSRC_Msk      (0x30000UL)               /*!< WRAPCNTSRC (Bitfield-Mask: 0x03)                      */
#define PROTIMER_CTRL_TOUT0SRC_Pos        (20UL)                    /*!< TOUT0SRC (Bit 20)                                     */
#define PROTIMER_CTRL_TOUT0SRC_Msk        (0x300000UL)              /*!< TOUT0SRC (Bitfield-Mask: 0x03)                        */
#define PROTIMER_CTRL_TOUT0SYNCSRC_Pos    (22UL)                    /*!< TOUT0SYNCSRC (Bit 22)                                 */
#define PROTIMER_CTRL_TOUT0SYNCSRC_Msk    (0xc00000UL)              /*!< TOUT0SYNCSRC (Bitfield-Mask: 0x03)                    */
#define PROTIMER_CTRL_TOUT1SRC_Pos        (24UL)                    /*!< TOUT1SRC (Bit 24)                                     */
#define PROTIMER_CTRL_TOUT1SRC_Msk        (0x3000000UL)             /*!< TOUT1SRC (Bitfield-Mask: 0x03)                        */
#define PROTIMER_CTRL_TOUT1SYNCSRC_Pos    (26UL)                    /*!< TOUT1SYNCSRC (Bit 26)                                 */
#define PROTIMER_CTRL_TOUT1SYNCSRC_Msk    (0xc000000UL)             /*!< TOUT1SYNCSRC (Bitfield-Mask: 0x03)                    */
#define PROTIMER_CTRL_TOUT0MODE_Pos       (28UL)                    /*!< TOUT0MODE (Bit 28)                                    */
#define PROTIMER_CTRL_TOUT0MODE_Msk       (0x10000000UL)            /*!< TOUT0MODE (Bitfield-Mask: 0x01)                       */
#define PROTIMER_CTRL_TOUT1MODE_Pos       (29UL)                    /*!< TOUT1MODE (Bit 29)                                    */
#define PROTIMER_CTRL_TOUT1MODE_Msk       (0x20000000UL)            /*!< TOUT1MODE (Bitfield-Mask: 0x01)                       */
/* ==========================================================  CMD  ========================================================== */
#define PROTIMER_CMD_START_Pos            (0UL)                     /*!< START (Bit 0)                                         */
#define PROTIMER_CMD_START_Msk            (0x1UL)                   /*!< START (Bitfield-Mask: 0x01)                           */
#define PROTIMER_CMD_RTCSYNCSTART_Pos     (1UL)                     /*!< RTCSYNCSTART (Bit 1)                                  */
#define PROTIMER_CMD_RTCSYNCSTART_Msk     (0x2UL)                   /*!< RTCSYNCSTART (Bitfield-Mask: 0x01)                    */
#define PROTIMER_CMD_STOP_Pos             (2UL)                     /*!< STOP (Bit 2)                                          */
#define PROTIMER_CMD_STOP_Msk             (0x4UL)                   /*!< STOP (Bitfield-Mask: 0x01)                            */
#define PROTIMER_CMD_TOUT0START_Pos       (4UL)                     /*!< TOUT0START (Bit 4)                                    */
#define PROTIMER_CMD_TOUT0START_Msk       (0x10UL)                  /*!< TOUT0START (Bitfield-Mask: 0x01)                      */
#define PROTIMER_CMD_TOUT0STOP_Pos        (5UL)                     /*!< TOUT0STOP (Bit 5)                                     */
#define PROTIMER_CMD_TOUT0STOP_Msk        (0x20UL)                  /*!< TOUT0STOP (Bitfield-Mask: 0x01)                       */
#define PROTIMER_CMD_TOUT1START_Pos       (6UL)                     /*!< TOUT1START (Bit 6)                                    */
#define PROTIMER_CMD_TOUT1START_Msk       (0x40UL)                  /*!< TOUT1START (Bitfield-Mask: 0x01)                      */
#define PROTIMER_CMD_TOUT1STOP_Pos        (7UL)                     /*!< TOUT1STOP (Bit 7)                                     */
#define PROTIMER_CMD_TOUT1STOP_Msk        (0x80UL)                  /*!< TOUT1STOP (Bitfield-Mask: 0x01)                       */
#define PROTIMER_CMD_LBTSTART_Pos         (8UL)                    /*!< LBTSTART (Bit 16)                                     */
#define PROTIMER_CMD_LBTSTART_Msk         (0x100UL)               /*!< LBTSTART (Bitfield-Mask: 0x01)                        */
//#define PROTIMER_CMD_LBTSTART_Pos         (16UL)                    /*!< LBTSTART (Bit 16)                                     */
//#define PROTIMER_CMD_LBTSTART_Msk         (0x10000UL)               /*!< LBTSTART (Bitfield-Mask: 0x01)                        */
#define PROTIMER_CMD_LBTSTOP_Pos          (10UL)                    /*!< LBTSTOP (Bit 18)                                      */
#define PROTIMER_CMD_LBTSTOP_Msk          (0x400UL)               /*!< LBTSTOP (Bitfield-Mask: 0x01)                         */
//#define PROTIMER_CMD_LBTSTOP_Pos          (18UL)                    /*!< LBTSTOP (Bit 18)                                      */
//#define PROTIMER_CMD_LBTSTOP_Msk          (0x40000UL)               /*!< LBTSTOP (Bitfield-Mask: 0x01)                         */
/* ========================================================  PRSCTRL  ======================================================== */
#define PROTIMER_PRSCTRL_STARTPRSEN_Pos   (1UL)                     /*!< STARTPRSEN (Bit 1)                                    */
#define PROTIMER_PRSCTRL_STARTPRSEN_Msk   (0x2UL)                   /*!< STARTPRSEN (Bitfield-Mask: 0x01)                      */
#define PROTIMER_PRSCTRL_STARTEDGE_Pos    (2UL)                     /*!< STARTEDGE (Bit 2)                                     */
#define PROTIMER_PRSCTRL_STARTEDGE_Msk    (0xcUL)                   /*!< STARTEDGE (Bitfield-Mask: 0x03)                       */
#define PROTIMER_PRSCTRL_STOPPRSEN_Pos    (9UL)                     /*!< STOPPRSEN (Bit 9)                                     */
#define PROTIMER_PRSCTRL_STOPPRSEN_Msk    (0x200UL)                 /*!< STOPPRSEN (Bitfield-Mask: 0x01)                       */
#define PROTIMER_PRSCTRL_STOPEDGE_Pos     (10UL)                    /*!< STOPEDGE (Bit 10)                                     */
#define PROTIMER_PRSCTRL_STOPEDGE_Msk     (0xc00UL)                 /*!< STOPEDGE (Bitfield-Mask: 0x03)                        */
#define PROTIMER_PRSCTRL_RTCCTRIGGERPRSEN_Pos (17UL)                /*!< RTCCTRIGGERPRSEN (Bit 17)                             */
#define PROTIMER_PRSCTRL_RTCCTRIGGERPRSEN_Msk (0x20000UL)           /*!< RTCCTRIGGERPRSEN (Bitfield-Mask: 0x01)                */
#define PROTIMER_PRSCTRL_RTCCTRIGGEREDGE_Pos (18UL)                 /*!< RTCCTRIGGEREDGE (Bit 18)                              */
#define PROTIMER_PRSCTRL_RTCCTRIGGEREDGE_Msk (0xc0000UL)            /*!< RTCCTRIGGEREDGE (Bitfield-Mask: 0x03)                 */
/* ========================================================  STATUS  ========================================================= */
#define PROTIMER_STATUS_RUNNING_Pos       (0UL)                     /*!< RUNNING (Bit 0)                                       */
#define PROTIMER_STATUS_RUNNING_Msk       (0x1UL)                   /*!< RUNNING (Bitfield-Mask: 0x01)                         */
#define PROTIMER_STATUS_LBTSYNC_Pos       (1UL)                     /*!< LBTSYNC (Bit 1)                                       */
#define PROTIMER_STATUS_LBTSYNC_Msk       (0x2UL)                   /*!< LBTSYNC (Bitfield-Mask: 0x01)                         */
#define PROTIMER_STATUS_LBTRUNNING_Pos    (2UL)                     /*!< LBTRUNNING (Bit 2)                                    */
#define PROTIMER_STATUS_LBTRUNNING_Msk    (0x4UL)                   /*!< LBTRUNNING (Bitfield-Mask: 0x01)                      */
#define PROTIMER_STATUS_LBTPAUSED_Pos     (3UL)                     /*!< LBTPAUSED (Bit 3)                                     */
#define PROTIMER_STATUS_LBTPAUSED_Msk     (0x8UL)                   /*!< LBTPAUSED (Bitfield-Mask: 0x01)                       */
#define PROTIMER_STATUS_TOUT0RUNNING_Pos  (4UL)                     /*!< TOUT0RUNNING (Bit 4)                                  */
#define PROTIMER_STATUS_TOUT0RUNNING_Msk  (0x10UL)                  /*!< TOUT0RUNNING (Bitfield-Mask: 0x01)                    */
#define PROTIMER_STATUS_TOUT0SYNC_Pos     (5UL)                     /*!< TOUT0SYNC (Bit 5)                                     */
#define PROTIMER_STATUS_TOUT0SYNC_Msk     (0x20UL)                  /*!< TOUT0SYNC (Bitfield-Mask: 0x01)                       */
#define PROTIMER_STATUS_TOUT1RUNNING_Pos  (6UL)                     /*!< TOUT1RUNNING (Bit 6)                                  */
#define PROTIMER_STATUS_TOUT1RUNNING_Msk  (0x40UL)                  /*!< TOUT1RUNNING (Bitfield-Mask: 0x01)                    */
#define PROTIMER_STATUS_TOUT1SYNC_Pos     (7UL)                     /*!< TOUT1SYNC (Bit 7)                                     */
#define PROTIMER_STATUS_TOUT1SYNC_Msk     (0x80UL)                  /*!< TOUT1SYNC (Bitfield-Mask: 0x01)                       */
#define PROTIMER_STATUS_ICV0_Pos          (8UL)                     /*!< ICV0 (Bit 8)                                          */
#define PROTIMER_STATUS_ICV0_Msk          (0x100UL)                 /*!< ICV0 (Bitfield-Mask: 0x01)                            */
#define PROTIMER_STATUS_ICV1_Pos          (9UL)                     /*!< ICV1 (Bit 9)                                          */
#define PROTIMER_STATUS_ICV1_Msk          (0x200UL)                 /*!< ICV1 (Bitfield-Mask: 0x01)                            */
#define PROTIMER_STATUS_ICV2_Pos          (10UL)                    /*!< ICV2 (Bit 10)                                         */
#define PROTIMER_STATUS_ICV2_Msk          (0x400UL)                 /*!< ICV2 (Bitfield-Mask: 0x01)                            */
#define PROTIMER_STATUS_ICV3_Pos          (11UL)                    /*!< ICV3 (Bit 11)                                         */
#define PROTIMER_STATUS_ICV3_Msk          (0x800UL)                 /*!< ICV3 (Bitfield-Mask: 0x01)                            */
#define PROTIMER_STATUS_ICV4_Pos          (12UL)                    /*!< ICV4 (Bit 12)                                         */
#define PROTIMER_STATUS_ICV4_Msk          (0x1000UL)                /*!< ICV4 (Bitfield-Mask: 0x01)                            */
/* ========================================================  PRECNT  ========================================================= */
#define PROTIMER_PRECNT_PRECNT_Pos        (0UL)                     /*!< PRECNT (Bit 0)                                        */
#define PROTIMER_PRECNT_PRECNT_Msk        (0xffffUL)                /*!< PRECNT (Bitfield-Mask: 0xffff)                        */
/* ========================================================  BASECNT  ======================================================== */
#define PROTIMER_BASECNT_BASECNT_Pos      (0UL)                     /*!< BASECNT (Bit 0)                                       */
#define PROTIMER_BASECNT_BASECNT_Msk      (0xffffUL)                /*!< BASECNT (Bitfield-Mask: 0xffff)                       */
/* ========================================================  WRAPCNT  ======================================================== */
#define PROTIMER_WRAPCNT_WRAPCNT_Pos      (0UL)                     /*!< WRAPCNT (Bit 0)                                       */
#define PROTIMER_WRAPCNT_WRAPCNT_Msk      (0xffffffffUL)            /*!< WRAPCNT (Bitfield-Mask: 0xffffffff)                   */
/* ========================================================  BASEPRE  ======================================================== */
#define PROTIMER_BASEPRE_PRECNTV_Pos      (0UL)                     /*!< PRECNTV (Bit 0)                                       */
#define PROTIMER_BASEPRE_PRECNTV_Msk      (0xffffUL)                /*!< PRECNTV (Bitfield-Mask: 0xffff)                       */
#define PROTIMER_BASEPRE_BASECNTV_Pos     (16UL)                    /*!< BASECNTV (Bit 16)                                     */
#define PROTIMER_BASEPRE_BASECNTV_Msk     (0xffff0000UL)            /*!< BASECNTV (Bitfield-Mask: 0xffff)                      */
/* =======================================================  LWRAPCNT  ======================================================== */
#define PROTIMER_LWRAPCNT_LWRAPCNT_Pos    (0UL)                     /*!< LWRAPCNT (Bit 0)                                      */
#define PROTIMER_LWRAPCNT_LWRAPCNT_Msk    (0xffffffffUL)            /*!< LWRAPCNT (Bitfield-Mask: 0xffffffff)                  */
/* =====================================================  PRECNTTOPADJ  ====================================================== */
#define PROTIMER_PRECNTTOPADJ_PRECNTTOPADJ_Pos (0UL)                /*!< PRECNTTOPADJ (Bit 0)                                  */
#define PROTIMER_PRECNTTOPADJ_PRECNTTOPADJ_Msk (0xffffUL)           /*!< PRECNTTOPADJ (Bitfield-Mask: 0xffff)                  */
/* =======================================================  PRECNTTOP  ======================================================= */
#define PROTIMER_PRECNTTOP_PRECNTTOPFRAC_Pos (0UL)                  /*!< PRECNTTOPFRAC (Bit 0)                                 */
#define PROTIMER_PRECNTTOP_PRECNTTOPFRAC_Msk (0xffUL)               /*!< PRECNTTOPFRAC (Bitfield-Mask: 0xff)                   */
#define PROTIMER_PRECNTTOP_PRECNTTOP_Pos  (8UL)                     /*!< PRECNTTOP (Bit 8)                                     */
#define PROTIMER_PRECNTTOP_PRECNTTOP_Msk  (0xffff00UL)              /*!< PRECNTTOP (Bitfield-Mask: 0xffff)                     */
/* ======================================================  BASECNTTOP  ======================================================= */
#define PROTIMER_BASECNTTOP_BASECNTTOP_Pos (0UL)                    /*!< BASECNTTOP (Bit 0)                                    */
#define PROTIMER_BASECNTTOP_BASECNTTOP_Msk (0xffffUL)               /*!< BASECNTTOP (Bitfield-Mask: 0xffff)                    */
/* ======================================================  WRAPCNTTOP  ======================================================= */
#define PROTIMER_WRAPCNTTOP_WRAPCNTTOP_Pos (0UL)                    /*!< WRAPCNTTOP (Bit 0)                                    */
#define PROTIMER_WRAPCNTTOP_WRAPCNTTOP_Msk (0xffffffffUL)           /*!< WRAPCNTTOP (Bitfield-Mask: 0xffffffff)                */
/* =======================================================  TOUT0CNT  ======================================================== */
#define PROTIMER_TOUT0CNT_TOUT0PCNT_Pos   (0UL)                     /*!< TOUT0PCNT (Bit 0)                                     */
#define PROTIMER_TOUT0CNT_TOUT0PCNT_Msk   (0xffffUL)                /*!< TOUT0PCNT (Bitfield-Mask: 0xffff)                     */
#define PROTIMER_TOUT0CNT_TOUT0CNT_Pos    (16UL)                    /*!< TOUT0CNT (Bit 16)                                     */
#define PROTIMER_TOUT0CNT_TOUT0CNT_Msk    (0xffff0000UL)            /*!< TOUT0CNT (Bitfield-Mask: 0xffff)                      */
/* ======================================================  TOUT0CNTTOP  ====================================================== */
#define PROTIMER_TOUT0CNTTOP_TOUT0PCNTTOP_Pos (0UL)                 /*!< TOUT0PCNTTOP (Bit 0)                                  */
#define PROTIMER_TOUT0CNTTOP_TOUT0PCNTTOP_Msk (0xffffUL)            /*!< TOUT0PCNTTOP (Bitfield-Mask: 0xffff)                  */
#define PROTIMER_TOUT0CNTTOP_TOUT0CNTTOP_Pos (16UL)                 /*!< TOUT0CNTTOP (Bit 16)                                  */
#define PROTIMER_TOUT0CNTTOP_TOUT0CNTTOP_Msk (0xffff0000UL)         /*!< TOUT0CNTTOP (Bitfield-Mask: 0xffff)                   */
/* =======================================================  TOUT0COMP  ======================================================= */
#define PROTIMER_TOUT0COMP_TOUT0PCNTCOMP_Pos (0UL)                  /*!< TOUT0PCNTCOMP (Bit 0)                                 */
#define PROTIMER_TOUT0COMP_TOUT0PCNTCOMP_Msk (0xffffUL)             /*!< TOUT0PCNTCOMP (Bitfield-Mask: 0xffff)                 */
#define PROTIMER_TOUT0COMP_TOUT0CNTCOMP_Pos (16UL)                  /*!< TOUT0CNTCOMP (Bit 16)                                 */
#define PROTIMER_TOUT0COMP_TOUT0CNTCOMP_Msk (0xffff0000UL)          /*!< TOUT0CNTCOMP (Bitfield-Mask: 0xffff)                  */
/* =======================================================  TOUT1CNT  ======================================================== */
#define PROTIMER_TOUT1CNT_TOUT1PCNT_Pos   (0UL)                     /*!< TOUT1PCNT (Bit 0)                                     */
#define PROTIMER_TOUT1CNT_TOUT1PCNT_Msk   (0xffffUL)                /*!< TOUT1PCNT (Bitfield-Mask: 0xffff)                     */
#define PROTIMER_TOUT1CNT_TOUT1CNT_Pos    (16UL)                    /*!< TOUT1CNT (Bit 16)                                     */
#define PROTIMER_TOUT1CNT_TOUT1CNT_Msk    (0xffff0000UL)            /*!< TOUT1CNT (Bitfield-Mask: 0xffff)                      */
/* ======================================================  TOUT1CNTTOP  ====================================================== */
#define PROTIMER_TOUT1CNTTOP_TOUT1PCNTTOP_Pos (0UL)                 /*!< TOUT1PCNTTOP (Bit 0)                                  */
#define PROTIMER_TOUT1CNTTOP_TOUT1PCNTTOP_Msk (0xffffUL)            /*!< TOUT1PCNTTOP (Bitfield-Mask: 0xffff)                  */
#define PROTIMER_TOUT1CNTTOP_TOUT1CNTTOP_Pos (16UL)                 /*!< TOUT1CNTTOP (Bit 16)                                  */
#define PROTIMER_TOUT1CNTTOP_TOUT1CNTTOP_Msk (0xffff0000UL)         /*!< TOUT1CNTTOP (Bitfield-Mask: 0xffff)                   */
/* =======================================================  TOUT1COMP  ======================================================= */
#define PROTIMER_TOUT1COMP_TOUT1PCNTCOMP_Pos (0UL)                  /*!< TOUT1PCNTCOMP (Bit 0)                                 */
#define PROTIMER_TOUT1COMP_TOUT1PCNTCOMP_Msk (0xffffUL)             /*!< TOUT1PCNTCOMP (Bitfield-Mask: 0xffff)                 */
#define PROTIMER_TOUT1COMP_TOUT1CNTCOMP_Pos (16UL)                  /*!< TOUT1CNTCOMP (Bit 16)                                 */
#define PROTIMER_TOUT1COMP_TOUT1CNTCOMP_Msk (0xffff0000UL)          /*!< TOUT1CNTCOMP (Bitfield-Mask: 0xffff)                  */
/* ========================================================  LBTCTRL  ======================================================== */
#define PROTIMER_LBTCTRL_STARTEXP_Pos     (0UL)                     /*!< STARTEXP (Bit 0)                                      */
#define PROTIMER_LBTCTRL_STARTEXP_Msk     (0xfUL)                   /*!< STARTEXP (Bitfield-Mask: 0x0f)                        */
#define PROTIMER_LBTCTRL_MAXEXP_Pos       (4UL)                     /*!< MAXEXP (Bit 4)                                        */
#define PROTIMER_LBTCTRL_MAXEXP_Msk       (0xf0UL)                  /*!< MAXEXP (Bitfield-Mask: 0x0f)                          */
#define PROTIMER_LBTCTRL_CCADELAY_Pos     (8UL)                     /*!< CCADELAY (Bit 8)                                      */
#define PROTIMER_LBTCTRL_CCADELAY_Msk     (0x1f00UL)                /*!< CCADELAY (Bitfield-Mask: 0x1f)                        */
#define PROTIMER_LBTCTRL_CCAREPEAT_Pos    (16UL)                    /*!< CCAREPEAT (Bit 16)                                    */
#define PROTIMER_LBTCTRL_CCAREPEAT_Msk    (0xf0000UL)               /*!< CCAREPEAT (Bitfield-Mask: 0x0f)                       */
#define PROTIMER_LBTCTRL_FIXEDBACKOFF_Pos (20UL)                    /*!< FIXEDBACKOFF (Bit 20)                                 */
#define PROTIMER_LBTCTRL_FIXEDBACKOFF_Msk (0x100000UL)              /*!< FIXEDBACKOFF (Bitfield-Mask: 0x01)                    */
#define PROTIMER_LBTCTRL_RETRYLIMIT_Pos   (24UL)                    /*!< RETRYLIMIT (Bit 24)                                   */
#define PROTIMER_LBTCTRL_RETRYLIMIT_Msk   (0xf000000UL)             /*!< RETRYLIMIT (Bitfield-Mask: 0x0f)                      */
/* ======================================================  LBTPRSCTRL  ======================================================= */
#define PROTIMER_LBTPRSCTRL_LBTSTARTPRSEN_Pos (8UL)                 /*!< LBTSTARTPRSEN (Bit 8)                                 */
#define PROTIMER_LBTPRSCTRL_LBTSTARTPRSEN_Msk (0x100UL)             /*!< LBTSTARTPRSEN (Bitfield-Mask: 0x01)                   */
#define PROTIMER_LBTPRSCTRL_LBTPAUSEPRSEN_Pos (16UL)                /*!< LBTPAUSEPRSEN (Bit 16)                                */
#define PROTIMER_LBTPRSCTRL_LBTPAUSEPRSEN_Msk (0x10000UL)           /*!< LBTPAUSEPRSEN (Bitfield-Mask: 0x01)                   */
#define PROTIMER_LBTPRSCTRL_LBTSTOPPRSEN_Pos (24UL)                 /*!< LBTSTOPPRSEN (Bit 24)                                 */
#define PROTIMER_LBTPRSCTRL_LBTSTOPPRSEN_Msk (0x1000000UL)          /*!< LBTSTOPPRSEN (Bitfield-Mask: 0x01)                    */
/* =======================================================  LBTSTATE  ======================================================== */
#define PROTIMER_LBTSTATE_TOUT0PCNT_Pos   (0UL)                     /*!< TOUT0PCNT (Bit 0)                                     */
#define PROTIMER_LBTSTATE_TOUT0PCNT_Msk   (0xffffUL)                /*!< TOUT0PCNT (Bitfield-Mask: 0xffff)                     */
#define PROTIMER_LBTSTATE_TOUT0CNT_Pos    (16UL)                    /*!< TOUT0CNT (Bit 16)                                     */
#define PROTIMER_LBTSTATE_TOUT0CNT_Msk    (0xffff0000UL)            /*!< TOUT0CNT (Bitfield-Mask: 0xffff)                      */
/* ========================================================  RANDOM  ========================================================= */
#define PROTIMER_RANDOM_RANDOM_Pos        (0UL)                     /*!< RANDOM (Bit 0)                                        */
#define PROTIMER_RANDOM_RANDOM_Msk        (0xffffUL)                /*!< RANDOM (Bitfield-Mask: 0xffff)                        */
/* ==========================================================  IF  =========================================================== */
#define PROTIMER_IF_PRECNTOF_Pos          (0UL)                     /*!< PRECNTOF (Bit 0)                                      */
#define PROTIMER_IF_PRECNTOF_Msk          (0x1UL)                   /*!< PRECNTOF (Bitfield-Mask: 0x01)                        */
#define PROTIMER_IF_BASECNTOF_Pos         (1UL)                     /*!< BASECNTOF (Bit 1)                                     */
#define PROTIMER_IF_BASECNTOF_Msk         (0x2UL)                   /*!< BASECNTOF (Bitfield-Mask: 0x01)                       */
