VDowbensky/efr32_baremetal/baremetal_test/device/efr32fg1v_protimer.h
#define PROTIMER_IF_WRAPCNTOF_Pos         (2UL)                     /*!< WRAPCNTOF (Bit 2)                                     */
#define PROTIMER_IF_WRAPCNTOF_Msk         (0x4UL)                   /*!< WRAPCNTOF (Bitfield-Mask: 0x01)                       */
#define PROTIMER_IF_TOUT0_Pos             (4UL)                     /*!< TOUT0 (Bit 4)                                         */
#define PROTIMER_IF_TOUT0_Msk             (0x10UL)                  /*!< TOUT0 (Bitfield-Mask: 0x01)                           */
#define PROTIMER_IF_TOUT1_Pos             (5UL)                     /*!< TOUT1 (Bit 5)                                         */
#define PROTIMER_IF_TOUT1_Msk             (0x20UL)                  /*!< TOUT1 (Bitfield-Mask: 0x01)                           */
#define PROTIMER_IF_TOUT0MATCH_Pos        (6UL)                     /*!< TOUT0MATCH (Bit 6)                                    */
#define PROTIMER_IF_TOUT0MATCH_Msk        (0x40UL)                  /*!< TOUT0MATCH (Bitfield-Mask: 0x01)                      */
#define PROTIMER_IF_TOUT1MATCH_Pos        (7UL)                     /*!< TOUT1MATCH (Bit 7)                                    */
#define PROTIMER_IF_TOUT1MATCH_Msk        (0x80UL)                  /*!< TOUT1MATCH (Bitfield-Mask: 0x01)                      */
#define PROTIMER_IF_CC0_Pos               (8UL)                     /*!< CC0 (Bit 8)                                           */
#define PROTIMER_IF_CC0_Msk               (0x100UL)                 /*!< CC0 (Bitfield-Mask: 0x01)                             */
#define PROTIMER_IF_CC1_Pos               (9UL)                     /*!< CC1 (Bit 9)                                           */
#define PROTIMER_IF_CC1_Msk               (0x200UL)                 /*!< CC1 (Bitfield-Mask: 0x01)                             */
#define PROTIMER_IF_CC2_Pos               (10UL)                    /*!< CC2 (Bit 10)                                          */
#define PROTIMER_IF_CC2_Msk               (0x400UL)                 /*!< CC2 (Bitfield-Mask: 0x01)                             */
#define PROTIMER_IF_CC3_Pos               (11UL)                    /*!< CC3 (Bit 11)                                          */
#define PROTIMER_IF_CC3_Msk               (0x800UL)                 /*!< CC3 (Bitfield-Mask: 0x01)                             */
#define PROTIMER_IF_CC4_Pos               (12UL)                    /*!< CC4 (Bit 12)                                          */
#define PROTIMER_IF_CC4_Msk               (0x1000UL)                /*!< CC4 (Bitfield-Mask: 0x01)                             */
#define PROTIMER_IF_CC5_Pos               (13UL)                    /*!< CC5 (Bit 13)                                          */
#define PROTIMER_IF_CC5_Msk               (0x2000UL)                /*!< CC5 (Bitfield-Mask: 0x01)                             */
#define PROTIMER_IF_CC6_Pos               (14UL)                    /*!< CC6 (Bit 14)                                          */
#define PROTIMER_IF_CC6_Msk               (0x4000UL)                /*!< CC6 (Bitfield-Mask: 0x01)                             */
#define PROTIMER_IF_CC7_Pos               (15UL)                    /*!< CC7 (Bit 15)                                          */
#define PROTIMER_IF_CC7_Msk               (0x8000UL)                /*!< CC7 (Bitfield-Mask: 0x01)                             */
#define PROTIMER_IF_COF0_Pos              (16UL)                    /*!< COF0 (Bit 16)                                         */
#define PROTIMER_IF_COF0_Msk              (0x10000UL)               /*!< COF0 (Bitfield-Mask: 0x01)                            */
#define PROTIMER_IF_COF1_Pos              (17UL)                    /*!< COF1 (Bit 17)                                         */
#define PROTIMER_IF_COF1_Msk              (0x20000UL)               /*!< COF1 (Bitfield-Mask: 0x01)                            */
#define PROTIMER_IF_COF2_Pos              (18UL)                    /*!< COF2 (Bit 18)                                         */
#define PROTIMER_IF_COF2_Msk              (0x40000UL)               /*!< COF2 (Bitfield-Mask: 0x01)                            */
#define PROTIMER_IF_COF3_Pos              (19UL)                    /*!< COF3 (Bit 19)                                         */
#define PROTIMER_IF_COF3_Msk              (0x80000UL)               /*!< COF3 (Bitfield-Mask: 0x01)                            */
#define PROTIMER_IF_COF4_Pos              (20UL)                    /*!< COF4 (Bit 20)                                         */
#define PROTIMER_IF_COF4_Msk              (0x100000UL)              /*!< COF4 (Bitfield-Mask: 0x01)                            */
#define PROTIMER_IF_COF5_Pos              (21UL)                    /*!< COF5 (Bit 21)                                         */
#define PROTIMER_IF_COF5_Msk              (0x200000UL)              /*!< COF5 (Bitfield-Mask: 0x01)                            */
#define PROTIMER_IF_COF6_Pos              (22UL)                    /*!< COF6 (Bit 22)                                         */
#define PROTIMER_IF_COF6_Msk              (0x400000UL)              /*!< COF6 (Bitfield-Mask: 0x01)                            */
#define PROTIMER_IF_COF7_Pos              (23UL)                    /*!< COF7 (Bit 23)                                         */
#define PROTIMER_IF_COF7_Msk              (0x800000UL)              /*!< COF7 (Bitfield-Mask: 0x01)                            */
#define PROTIMER_IF_LBTSUCCESS_Pos        (24UL)                    /*!< LBTSUCCESS (Bit 24)                                   */
#define PROTIMER_IF_LBTSUCCESS_Msk        (0x1000000UL)             /*!< LBTSUCCESS (Bitfield-Mask: 0x01)                      */
#define PROTIMER_IF_LBTFAILURE_Pos        (25UL)                    /*!< LBTFAILURE (Bit 25)                                   */
#define PROTIMER_IF_LBTFAILURE_Msk        (0x2000000UL)             /*!< LBTFAILURE (Bitfield-Mask: 0x01)                      */
#define PROTIMER_IF_LBTPAUSED_Pos         (26UL)                    /*!< LBTPAUSED (Bit 26)                                    */
#define PROTIMER_IF_LBTPAUSED_Msk         (0x4000000UL)             /*!< LBTPAUSED (Bitfield-Mask: 0x01)                       */
#define PROTIMER_IF_LBTRETRY_Pos          (27UL)                    /*!< LBTRETRY (Bit 27)                                     */
#define PROTIMER_IF_LBTRETRY_Msk          (0x8000000UL)             /*!< LBTRETRY (Bitfield-Mask: 0x01)                        */
#define PROTIMER_IF_RTCCSYNCHED_Pos       (28UL)                    /*!< RTCCSYNCHED (Bit 28)                                  */
#define PROTIMER_IF_RTCCSYNCHED_Msk       (0x10000000UL)            /*!< RTCCSYNCHED (Bitfield-Mask: 0x01)                     */
#define PROTIMER_IF_TOUT0MATCHLBT_Pos     (29UL)                    /*!< TOUT0MATCHLBT (Bit 29)                                */
#define PROTIMER_IF_TOUT0MATCHLBT_Msk     (0x20000000UL)            /*!< TOUT0MATCHLBT (Bitfield-Mask: 0x01)                   */
/* ==========================================================  IFS  ========================================================== */
#define PROTIMER_IFS_PRECNTOF_Pos         (0UL)                     /*!< PRECNTOF (Bit 0)                                      */
#define PROTIMER_IFS_PRECNTOF_Msk         (0x1UL)                   /*!< PRECNTOF (Bitfield-Mask: 0x01)                        */
#define PROTIMER_IFS_BASECNTOF_Pos        (1UL)                     /*!< BASECNTOF (Bit 1)                                     */
#define PROTIMER_IFS_BASECNTOF_Msk        (0x2UL)                   /*!< BASECNTOF (Bitfield-Mask: 0x01)                       */
#define PROTIMER_IFS_WRAPCNTOF_Pos        (2UL)                     /*!< WRAPCNTOF (Bit 2)                                     */
#define PROTIMER_IFS_WRAPCNTOF_Msk        (0x4UL)                   /*!< WRAPCNTOF (Bitfield-Mask: 0x01)                       */
#define PROTIMER_IFS_TOUT0_Pos            (4UL)                     /*!< TOUT0 (Bit 4)                                         */
#define PROTIMER_IFS_TOUT0_Msk            (0x10UL)                  /*!< TOUT0 (Bitfield-Mask: 0x01)                           */
#define PROTIMER_IFS_TOUT1_Pos            (5UL)                     /*!< TOUT1 (Bit 5)                                         */
#define PROTIMER_IFS_TOUT1_Msk            (0x20UL)                  /*!< TOUT1 (Bitfield-Mask: 0x01)                           */
#define PROTIMER_IFS_TOUT0MATCH_Pos       (6UL)                     /*!< TOUT0MATCH (Bit 6)                                    */
#define PROTIMER_IFS_TOUT0MATCH_Msk       (0x40UL)                  /*!< TOUT0MATCH (Bitfield-Mask: 0x01)                      */
#define PROTIMER_IFS_TOUT1MATCH_Pos       (7UL)                     /*!< TOUT1MATCH (Bit 7)                                    */
#define PROTIMER_IFS_TOUT1MATCH_Msk       (0x80UL)                  /*!< TOUT1MATCH (Bitfield-Mask: 0x01)                      */
#define PROTIMER_IFS_CC0_Pos              (8UL)                     /*!< CC0 (Bit 8)                                           */
#define PROTIMER_IFS_CC0_Msk              (0x100UL)                 /*!< CC0 (Bitfield-Mask: 0x01)                             */
#define PROTIMER_IFS_CC1_Pos              (9UL)                     /*!< CC1 (Bit 9)                                           */
#define PROTIMER_IFS_CC1_Msk              (0x200UL)                 /*!< CC1 (Bitfield-Mask: 0x01)                             */
#define PROTIMER_IFS_CC2_Pos              (10UL)                    /*!< CC2 (Bit 10)                                          */
#define PROTIMER_IFS_CC2_Msk              (0x400UL)                 /*!< CC2 (Bitfield-Mask: 0x01)                             */
#define PROTIMER_IFS_CC3_Pos              (11UL)                    /*!< CC3 (Bit 11)                                          */
#define PROTIMER_IFS_CC3_Msk              (0x800UL)                 /*!< CC3 (Bitfield-Mask: 0x01)                             */
#define PROTIMER_IFS_CC4_Pos              (12UL)                    /*!< CC4 (Bit 12)                                          */
#define PROTIMER_IFS_CC4_Msk              (0x1000UL)                /*!< CC4 (Bitfield-Mask: 0x01)                             */
#define PROTIMER_IFS_CC5_Pos              (13UL)                    /*!< CC5 (Bit 13)                                          */
#define PROTIMER_IFS_CC5_Msk              (0x2000UL)                /*!< CC5 (Bitfield-Mask: 0x01)                             */
#define PROTIMER_IFS_CC6_Pos              (14UL)                    /*!< CC6 (Bit 14)                                          */
#define PROTIMER_IFS_CC6_Msk              (0x4000UL)                /*!< CC6 (Bitfield-Mask: 0x01)                             */
#define PROTIMER_IFS_CC7_Pos              (15UL)                    /*!< CC7 (Bit 15)                                          */
#define PROTIMER_IFS_CC7_Msk              (0x8000UL)                /*!< CC7 (Bitfield-Mask: 0x01)                             */
#define PROTIMER_IFS_COF0_Pos             (16UL)                    /*!< COF0 (Bit 16)                                         */
#define PROTIMER_IFS_COF0_Msk             (0x10000UL)               /*!< COF0 (Bitfield-Mask: 0x01)                            */
#define PROTIMER_IFS_COF1_Pos             (17UL)                    /*!< COF1 (Bit 17)                                         */
#define PROTIMER_IFS_COF1_Msk             (0x20000UL)               /*!< COF1 (Bitfield-Mask: 0x01)                            */
#define PROTIMER_IFS_COF2_Pos             (18UL)                    /*!< COF2 (Bit 18)                                         */
#define PROTIMER_IFS_COF2_Msk             (0x40000UL)               /*!< COF2 (Bitfield-Mask: 0x01)                            */
#define PROTIMER_IFS_COF3_Pos             (19UL)                    /*!< COF3 (Bit 19)                                         */
#define PROTIMER_IFS_COF3_Msk             (0x80000UL)               /*!< COF3 (Bitfield-Mask: 0x01)                            */
#define PROTIMER_IFS_COF4_Pos             (20UL)                    /*!< COF4 (Bit 20)                                         */
#define PROTIMER_IFS_COF4_Msk             (0x100000UL)              /*!< COF4 (Bitfield-Mask: 0x01)                            */
#define PROTIMER_IFS_COF5_Pos             (21UL)                    /*!< COF5 (Bit 21)                                         */
#define PROTIMER_IFS_COF5_Msk             (0x200000UL)              /*!< COF5 (Bitfield-Mask: 0x01)                            */
#define PROTIMER_IFS_COF6_Pos             (22UL)                    /*!< COF6 (Bit 22)                                         */
#define PROTIMER_IFS_COF6_Msk             (0x400000UL)              /*!< COF6 (Bitfield-Mask: 0x01)                            */
#define PROTIMER_IFS_COF7_Pos             (23UL)                    /*!< COF7 (Bit 23)                                         */
#define PROTIMER_IFS_COF7_Msk             (0x800000UL)              /*!< COF7 (Bitfield-Mask: 0x01)                            */
#define PROTIMER_IFS_LBTSUCCESS_Pos       (24UL)                    /*!< LBTSUCCESS (Bit 24)                                   */
#define PROTIMER_IFS_LBTSUCCESS_Msk       (0x1000000UL)             /*!< LBTSUCCESS (Bitfield-Mask: 0x01)                      */
#define PROTIMER_IFS_LBTFAILURE_Pos       (25UL)                    /*!< LBTFAILURE (Bit 25)                                   */
#define PROTIMER_IFS_LBTFAILURE_Msk       (0x2000000UL)             /*!< LBTFAILURE (Bitfield-Mask: 0x01)                      */
#define PROTIMER_IFS_LBTPAUSED_Pos        (26UL)                    /*!< LBTPAUSED (Bit 26)                                    */
#define PROTIMER_IFS_LBTPAUSED_Msk        (0x4000000UL)             /*!< LBTPAUSED (Bitfield-Mask: 0x01)                       */
#define PROTIMER_IFS_LBTRETRY_Pos         (27UL)                    /*!< LBTRETRY (Bit 27)                                     */
#define PROTIMER_IFS_LBTRETRY_Msk         (0x8000000UL)             /*!< LBTRETRY (Bitfield-Mask: 0x01)                        */
#define PROTIMER_IFS_RTCCSYNCHED_Pos      (28UL)                    /*!< RTCCSYNCHED (Bit 28)                                  */
#define PROTIMER_IFS_RTCCSYNCHED_Msk      (0x10000000UL)            /*!< RTCCSYNCHED (Bitfield-Mask: 0x01)                     */
#define PROTIMER_IFS_TOUT0MATCHLBT_Pos    (29UL)                    /*!< TOUT0MATCHLBT (Bit 29)                                */
#define PROTIMER_IFS_TOUT0MATCHLBT_Msk    (0x20000000UL)            /*!< TOUT0MATCHLBT (Bitfield-Mask: 0x01)                   */
/* ==========================================================  IFC  ========================================================== */
#define PROTIMER_IFC_PRECNTOF_Pos         (0UL)                     /*!< PRECNTOF (Bit 0)                                      */
#define PROTIMER_IFC_PRECNTOF_Msk         (0x1UL)                   /*!< PRECNTOF (Bitfield-Mask: 0x01)                        */
#define PROTIMER_IFC_BASECNTOF_Pos        (1UL)                     /*!< BASECNTOF (Bit 1)                                     */
#define PROTIMER_IFC_BASECNTOF_Msk        (0x2UL)                   /*!< BASECNTOF (Bitfield-Mask: 0x01)                       */
#define PROTIMER_IFC_WRAPCNTOF_Pos        (2UL)                     /*!< WRAPCNTOF (Bit 2)                                     */
#define PROTIMER_IFC_WRAPCNTOF_Msk        (0x4UL)                   /*!< WRAPCNTOF (Bitfield-Mask: 0x01)                       */
#define PROTIMER_IFC_TOUT0_Pos            (4UL)                     /*!< TOUT0 (Bit 4)                                         */
#define PROTIMER_IFC_TOUT0_Msk            (0x10UL)                  /*!< TOUT0 (Bitfield-Mask: 0x01)                           */
#define PROTIMER_IFC_TOUT1_Pos            (5UL)                     /*!< TOUT1 (Bit 5)                                         */
#define PROTIMER_IFC_TOUT1_Msk            (0x20UL)                  /*!< TOUT1 (Bitfield-Mask: 0x01)                           */
#define PROTIMER_IFC_TOUT0MATCH_Pos       (6UL)                     /*!< TOUT0MATCH (Bit 6)                                    */
#define PROTIMER_IFC_TOUT0MATCH_Msk       (0x40UL)                  /*!< TOUT0MATCH (Bitfield-Mask: 0x01)                      */
#define PROTIMER_IFC_TOUT1MATCH_Pos       (7UL)                     /*!< TOUT1MATCH (Bit 7)                                    */
#define PROTIMER_IFC_TOUT1MATCH_Msk       (0x80UL)                  /*!< TOUT1MATCH (Bitfield-Mask: 0x01)                      */
#define PROTIMER_IFC_CC0_Pos              (8UL)                     /*!< CC0 (Bit 8)                                           */
#define PROTIMER_IFC_CC0_Msk              (0x100UL)                 /*!< CC0 (Bitfield-Mask: 0x01)                             */
#define PROTIMER_IFC_CC1_Pos              (9UL)                     /*!< CC1 (Bit 9)                                           */
#define PROTIMER_IFC_CC1_Msk              (0x200UL)                 /*!< CC1 (Bitfield-Mask: 0x01)                             */
#define PROTIMER_IFC_CC2_Pos              (10UL)                    /*!< CC2 (Bit 10)                                          */
#define PROTIMER_IFC_CC2_Msk              (0x400UL)                 /*!< CC2 (Bitfield-Mask: 0x01)                             */
#define PROTIMER_IFC_CC3_Pos              (11UL)                    /*!< CC3 (Bit 11)                                          */
#define PROTIMER_IFC_CC3_Msk              (0x800UL)                 /*!< CC3 (Bitfield-Mask: 0x01)                             */
#define PROTIMER_IFC_CC4_Pos              (12UL)                    /*!< CC4 (Bit 12)                                          */
#define PROTIMER_IFC_CC4_Msk              (0x1000UL)                /*!< CC4 (Bitfield-Mask: 0x01)                             */
#define PROTIMER_IFC_CC5_Pos              (13UL)                    /*!< CC5 (Bit 13)                                          */
#define PROTIMER_IFC_CC5_Msk              (0x2000UL)                /*!< CC5 (Bitfield-Mask: 0x01)                             */
#define PROTIMER_IFC_CC6_Pos              (14UL)                    /*!< CC6 (Bit 14)                                          */
#define PROTIMER_IFC_CC6_Msk              (0x4000UL)                /*!< CC6 (Bitfield-Mask: 0x01)                             */
#define PROTIMER_IFC_CC7_Pos              (15UL)                    /*!< CC7 (Bit 15)                                          */
#define PROTIMER_IFC_CC7_Msk              (0x8000UL)                /*!< CC7 (Bitfield-Mask: 0x01)                             */
#define PROTIMER_IFC_COF0_Pos             (16UL)                    /*!< COF0 (Bit 16)                                         */
#define PROTIMER_IFC_COF0_Msk             (0x10000UL)               /*!< COF0 (Bitfield-Mask: 0x01)                            */
#define PROTIMER_IFC_COF1_Pos             (17UL)                    /*!< COF1 (Bit 17)                                         */
#define PROTIMER_IFC_COF1_Msk             (0x20000UL)               /*!< COF1 (Bitfield-Mask: 0x01)                            */
#define PROTIMER_IFC_COF2_Pos             (18UL)                    /*!< COF2 (Bit 18)                                         */
#define PROTIMER_IFC_COF2_Msk             (0x40000UL)               /*!< COF2 (Bitfield-Mask: 0x01)                            */
#define PROTIMER_IFC_COF3_Pos             (19UL)                    /*!< COF3 (Bit 19)                                         */
#define PROTIMER_IFC_COF3_Msk             (0x80000UL)               /*!< COF3 (Bitfield-Mask: 0x01)                            */
#define PROTIMER_IFC_COF4_Pos             (20UL)                    /*!< COF4 (Bit 20)                                         */
#define PROTIMER_IFC_COF4_Msk             (0x100000UL)              /*!< COF4 (Bitfield-Mask: 0x01)                            */
#define PROTIMER_IFC_COF5_Pos             (21UL)                    /*!< COF5 (Bit 21)                                         */
#define PROTIMER_IFC_COF5_Msk             (0x200000UL)              /*!< COF5 (Bitfield-Mask: 0x01)                            */
#define PROTIMER_IFC_COF6_Pos             (22UL)                    /*!< COF6 (Bit 22)                                         */
#define PROTIMER_IFC_COF6_Msk             (0x400000UL)              /*!< COF6 (Bitfield-Mask: 0x01)                            */
#define PROTIMER_IFC_COF7_Pos             (23UL)                    /*!< COF7 (Bit 23)                                         */
#define PROTIMER_IFC_COF7_Msk             (0x800000UL)              /*!< COF7 (Bitfield-Mask: 0x01)                            */
#define PROTIMER_IFC_LBTSUCCESS_Pos       (24UL)                    /*!< LBTSUCCESS (Bit 24)                                   */
#define PROTIMER_IFC_LBTSUCCESS_Msk       (0x1000000UL)             /*!< LBTSUCCESS (Bitfield-Mask: 0x01)                      */
#define PROTIMER_IFC_LBTFAILURE_Pos       (25UL)                    /*!< LBTFAILURE (Bit 25)                                   */
#define PROTIMER_IFC_LBTFAILURE_Msk       (0x2000000UL)             /*!< LBTFAILURE (Bitfield-Mask: 0x01)                      */
#define PROTIMER_IFC_LBTPAUSED_Pos        (26UL)                    /*!< LBTPAUSED (Bit 26)                                    */
#define PROTIMER_IFC_LBTPAUSED_Msk        (0x4000000UL)             /*!< LBTPAUSED (Bitfield-Mask: 0x01)                       */
#define PROTIMER_IFC_LBTRETRY_Pos         (27UL)                    /*!< LBTRETRY (Bit 27)                                     */
#define PROTIMER_IFC_LBTRETRY_Msk         (0x8000000UL)             /*!< LBTRETRY (Bitfield-Mask: 0x01)                        */
#define PROTIMER_IFC_RTCCSYNCHED_Pos      (28UL)                    /*!< RTCCSYNCHED (Bit 28)                                  */
#define PROTIMER_IFC_RTCCSYNCHED_Msk      (0x10000000UL)            /*!< RTCCSYNCHED (Bitfield-Mask: 0x01)                     */
#define PROTIMER_IFC_TOUT0MATCHLBT_Pos    (29UL)                    /*!< TOUT0MATCHLBT (Bit 29)                                */
#define PROTIMER_IFC_TOUT0MATCHLBT_Msk    (0x20000000UL)            /*!< TOUT0MATCHLBT (Bitfield-Mask: 0x01)                   */
/* ==========================================================  IEN  ========================================================== */
#define PROTIMER_IEN_PRECNTOF_Pos         (0UL)                     /*!< PRECNTOF (Bit 0)                                      */
#define PROTIMER_IEN_PRECNTOF_Msk         (0x1UL)                   /*!< PRECNTOF (Bitfield-Mask: 0x01)                        */
#define PROTIMER_IEN_BASECNTOF_Pos        (1UL)                     /*!< BASECNTOF (Bit 1)                                     */
#define PROTIMER_IEN_BASECNTOF_Msk        (0x2UL)                   /*!< BASECNTOF (Bitfield-Mask: 0x01)                       */
#define PROTIMER_IEN_WRAPCNTOF_Pos        (2UL)                     /*!< WRAPCNTOF (Bit 2)                                     */
#define PROTIMER_IEN_WRAPCNTOF_Msk        (0x4UL)                   /*!< WRAPCNTOF (Bitfield-Mask: 0x01)                       */
#define PROTIMER_IEN_TOUT0_Pos            (4UL)                     /*!< TOUT0 (Bit 4)                                         */
#define PROTIMER_IEN_TOUT0_Msk            (0x10UL)                  /*!< TOUT0 (Bitfield-Mask: 0x01)                           */
#define PROTIMER_IEN_TOUT1_Pos            (5UL)                     /*!< TOUT1 (Bit 5)                                         */
#define PROTIMER_IEN_TOUT1_Msk            (0x20UL)                  /*!< TOUT1 (Bitfield-Mask: 0x01)                           */
#define PROTIMER_IEN_TOUT0MATCH_Pos       (6UL)                     /*!< TOUT0MATCH (Bit 6)                                    */
