VDowbensky/efr32_baremetal/baremetal_test/device/efr32fg1v_protimer.h
#define PROTIMER_IEN_TOUT0MATCH_Msk       (0x40UL)                  /*!< TOUT0MATCH (Bitfield-Mask: 0x01)                      */
#define PROTIMER_IEN_TOUT1MATCH_Pos       (7UL)                     /*!< TOUT1MATCH (Bit 7)                                    */
#define PROTIMER_IEN_TOUT1MATCH_Msk       (0x80UL)                  /*!< TOUT1MATCH (Bitfield-Mask: 0x01)                      */
#define PROTIMER_IEN_CC0_Pos              (8UL)                     /*!< CC0 (Bit 8)                                           */
#define PROTIMER_IEN_CC0_Msk              (0x100UL)                 /*!< CC0 (Bitfield-Mask: 0x01)                             */
#define PROTIMER_IEN_CC1_Pos              (9UL)                     /*!< CC1 (Bit 9)                                           */
#define PROTIMER_IEN_CC1_Msk              (0x200UL)                 /*!< CC1 (Bitfield-Mask: 0x01)                             */
#define PROTIMER_IEN_CC2_Pos              (10UL)                    /*!< CC2 (Bit 10)                                          */
#define PROTIMER_IEN_CC2_Msk              (0x400UL)                 /*!< CC2 (Bitfield-Mask: 0x01)                             */
#define PROTIMER_IEN_CC3_Pos              (11UL)                    /*!< CC3 (Bit 11)                                          */
#define PROTIMER_IEN_CC3_Msk              (0x800UL)                 /*!< CC3 (Bitfield-Mask: 0x01)                             */
#define PROTIMER_IEN_CC4_Pos              (12UL)                    /*!< CC4 (Bit 12)                                          */
#define PROTIMER_IEN_CC4_Msk              (0x1000UL)                /*!< CC4 (Bitfield-Mask: 0x01)                             */
#define PROTIMER_IEN_CC5_Pos              (13UL)                    /*!< CC5 (Bit 13)                                          */
#define PROTIMER_IEN_CC5_Msk              (0x2000UL)                /*!< CC5 (Bitfield-Mask: 0x01)                             */
#define PROTIMER_IEN_CC6_Pos              (14UL)                    /*!< CC6 (Bit 14)                                          */
#define PROTIMER_IEN_CC6_Msk              (0x4000UL)                /*!< CC6 (Bitfield-Mask: 0x01)                             */
#define PROTIMER_IEN_CC7_Pos              (15UL)                    /*!< CC7 (Bit 15)                                          */
#define PROTIMER_IEN_CC7_Msk              (0x8000UL)                /*!< CC7 (Bitfield-Mask: 0x01)                             */
#define PROTIMER_IEN_COF0_Pos             (16UL)                    /*!< COF0 (Bit 16)                                         */
#define PROTIMER_IEN_COF0_Msk             (0x10000UL)               /*!< COF0 (Bitfield-Mask: 0x01)                            */
#define PROTIMER_IEN_COF1_Pos             (17UL)                    /*!< COF1 (Bit 17)                                         */
#define PROTIMER_IEN_COF1_Msk             (0x20000UL)               /*!< COF1 (Bitfield-Mask: 0x01)                            */
#define PROTIMER_IEN_COF2_Pos             (18UL)                    /*!< COF2 (Bit 18)                                         */
#define PROTIMER_IEN_COF2_Msk             (0x40000UL)               /*!< COF2 (Bitfield-Mask: 0x01)                            */
#define PROTIMER_IEN_COF3_Pos             (19UL)                    /*!< COF3 (Bit 19)                                         */
#define PROTIMER_IEN_COF3_Msk             (0x80000UL)               /*!< COF3 (Bitfield-Mask: 0x01)                            */
#define PROTIMER_IEN_COF4_Pos             (20UL)                    /*!< COF4 (Bit 20)                                         */
#define PROTIMER_IEN_COF4_Msk             (0x100000UL)              /*!< COF4 (Bitfield-Mask: 0x01)                            */
#define PROTIMER_IEN_COF5_Pos             (21UL)                    /*!< COF5 (Bit 21)                                         */
#define PROTIMER_IEN_COF5_Msk             (0x200000UL)              /*!< COF5 (Bitfield-Mask: 0x01)                            */
#define PROTIMER_IEN_COF6_Pos             (22UL)                    /*!< COF6 (Bit 22)                                         */
#define PROTIMER_IEN_COF6_Msk             (0x400000UL)              /*!< COF6 (Bitfield-Mask: 0x01)                            */
#define PROTIMER_IEN_COF7_Pos             (23UL)                    /*!< COF7 (Bit 23)                                         */
#define PROTIMER_IEN_COF7_Msk             (0x800000UL)              /*!< COF7 (Bitfield-Mask: 0x01)                            */
#define PROTIMER_IEN_LBTSUCCESS_Pos       (24UL)                    /*!< LBTSUCCESS (Bit 24)                                   */
#define PROTIMER_IEN_LBTSUCCESS_Msk       (0x1000000UL)             /*!< LBTSUCCESS (Bitfield-Mask: 0x01)                      */
#define PROTIMER_IEN_LBTFAILURE_Pos       (25UL)                    /*!< LBTFAILURE (Bit 25)                                   */
#define PROTIMER_IEN_LBTFAILURE_Msk       (0x2000000UL)             /*!< LBTFAILURE (Bitfield-Mask: 0x01)                      */
#define PROTIMER_IEN_LBTPAUSED_Pos        (26UL)                    /*!< LBTPAUSED (Bit 26)                                    */
#define PROTIMER_IEN_LBTPAUSED_Msk        (0x4000000UL)             /*!< LBTPAUSED (Bitfield-Mask: 0x01)                       */
#define PROTIMER_IEN_LBTRETRY_Pos         (27UL)                    /*!< LBTRETRY (Bit 27)                                     */
#define PROTIMER_IEN_LBTRETRY_Msk         (0x8000000UL)             /*!< LBTRETRY (Bitfield-Mask: 0x01)                        */
#define PROTIMER_IEN_RTCCSYNCHED_Pos      (28UL)                    /*!< RTCCSYNCHED (Bit 28)                                  */
#define PROTIMER_IEN_RTCCSYNCHED_Msk      (0x10000000UL)            /*!< RTCCSYNCHED (Bitfield-Mask: 0x01)                     */
#define PROTIMER_IEN_TOUT0MATCHLBT_Pos    (29UL)                    /*!< TOUT0MATCHLBT (Bit 29)                                */
#define PROTIMER_IEN_TOUT0MATCHLBT_Msk    (0x20000000UL)            /*!< TOUT0MATCHLBT (Bitfield-Mask: 0x01)                   */
/* ========================================================  RXCTRL  ========================================================= */
#define PROTIMER_RXCTRL_RXSETEVENT1_Pos   (0UL)                     /*!< RXSETEVENT1 (Bit 0)                                   */
#define PROTIMER_RXCTRL_RXSETEVENT1_Msk   (0x1fUL)                  /*!< RXSETEVENT1 (Bitfield-Mask: 0x1f)                     */
#define PROTIMER_RXCTRL_RXSETEVENT2_Pos   (8UL)                     /*!< RXSETEVENT2 (Bit 8)                                   */
#define PROTIMER_RXCTRL_RXSETEVENT2_Msk   (0x1f00UL)                /*!< RXSETEVENT2 (Bitfield-Mask: 0x1f)                     */
#define PROTIMER_RXCTRL_RXCLREVENT1_Pos   (16UL)                    /*!< RXCLREVENT1 (Bit 16)                                  */
#define PROTIMER_RXCTRL_RXCLREVENT1_Msk   (0x1f0000UL)              /*!< RXCLREVENT1 (Bitfield-Mask: 0x1f)                     */
#define PROTIMER_RXCTRL_RXCLREVENT2_Pos   (24UL)                    /*!< RXCLREVENT2 (Bit 24)                                  */
#define PROTIMER_RXCTRL_RXCLREVENT2_Msk   (0x1f000000UL)            /*!< RXCLREVENT2 (Bitfield-Mask: 0x1f)                     */
/* ========================================================  TXCTRL  ========================================================= */
#define PROTIMER_TXCTRL_TXSETEVENT1_Pos   (0UL)                     /*!< TXSETEVENT1 (Bit 0)                                   */
#define PROTIMER_TXCTRL_TXSETEVENT1_Msk   (0x1fUL)                  /*!< TXSETEVENT1 (Bitfield-Mask: 0x1f)                     */
#define PROTIMER_TXCTRL_TXSETEVENT2_Pos   (8UL)                     /*!< TXSETEVENT2 (Bit 8)                                   */
#define PROTIMER_TXCTRL_TXSETEVENT2_Msk   (0x1f00UL)                /*!< TXSETEVENT2 (Bitfield-Mask: 0x1f)                     */
/* =======================================================  CC0_CTRL  ======================================================== */
#define PROTIMER_CC0_CTRL_ENABLE_Pos      (0UL)                     /*!< ENABLE (Bit 0)                                        */
#define PROTIMER_CC0_CTRL_ENABLE_Msk      (0x1UL)                   /*!< ENABLE (Bitfield-Mask: 0x01)                          */
#define PROTIMER_CC0_CTRL_CCMODE_Pos      (1UL)                     /*!< CCMODE (Bit 1)                                        */
#define PROTIMER_CC0_CTRL_CCMODE_Msk      (0x2UL)                   /*!< CCMODE (Bitfield-Mask: 0x01)                          */
#define PROTIMER_CC0_CTRL_PREMATCHEN_Pos  (2UL)                     /*!< PREMATCHEN (Bit 2)                                    */
#define PROTIMER_CC0_CTRL_PREMATCHEN_Msk  (0x4UL)                   /*!< PREMATCHEN (Bitfield-Mask: 0x01)                      */
#define PROTIMER_CC0_CTRL_BASEMATCHEN_Pos (3UL)                     /*!< BASEMATCHEN (Bit 3)                                   */
#define PROTIMER_CC0_CTRL_BASEMATCHEN_Msk (0x8UL)                   /*!< BASEMATCHEN (Bitfield-Mask: 0x01)                     */
#define PROTIMER_CC0_CTRL_WRAPMATCHEN_Pos (4UL)                     /*!< WRAPMATCHEN (Bit 4)                                   */
#define PROTIMER_CC0_CTRL_WRAPMATCHEN_Msk (0x10UL)                  /*!< WRAPMATCHEN (Bitfield-Mask: 0x01)                     */
#define PROTIMER_CC0_CTRL_OIST_Pos        (5UL)                     /*!< OIST (Bit 5)                                          */
#define PROTIMER_CC0_CTRL_OIST_Msk        (0x20UL)                  /*!< OIST (Bitfield-Mask: 0x01)                            */
#define PROTIMER_CC0_CTRL_OUTINV_Pos      (6UL)                     /*!< OUTINV (Bit 6)                                        */
#define PROTIMER_CC0_CTRL_OUTINV_Msk      (0x40UL)                  /*!< OUTINV (Bitfield-Mask: 0x01)                          */
#define PROTIMER_CC0_CTRL_MOA_Pos         (8UL)                     /*!< MOA (Bit 8)                                           */
#define PROTIMER_CC0_CTRL_MOA_Msk         (0x300UL)                 /*!< MOA (Bitfield-Mask: 0x03)                             */
#define PROTIMER_CC0_CTRL_OFOA_Pos        (10UL)                    /*!< OFOA (Bit 10)                                         */
#define PROTIMER_CC0_CTRL_OFOA_Msk        (0xc00UL)                 /*!< OFOA (Bitfield-Mask: 0x03)                            */
#define PROTIMER_CC0_CTRL_OFSEL_Pos       (12UL)                    /*!< OFSEL (Bit 12)                                        */
#define PROTIMER_CC0_CTRL_OFSEL_Msk       (0x3000UL)                /*!< OFSEL (Bitfield-Mask: 0x03)                           */
#define PROTIMER_CC0_CTRL_PRSCONF_Pos     (14UL)                    /*!< PRSCONF (Bit 14)                                      */
#define PROTIMER_CC0_CTRL_PRSCONF_Msk     (0x4000UL)                /*!< PRSCONF (Bitfield-Mask: 0x01)                         */
#define PROTIMER_CC0_CTRL_INSEL_Pos       (21UL)                    /*!< INSEL (Bit 21)                                        */
#define PROTIMER_CC0_CTRL_INSEL_Msk       (0x1e00000UL)             /*!< INSEL (Bitfield-Mask: 0x0f)                           */
#define PROTIMER_CC0_CTRL_ICEDGE_Pos      (25UL)                    /*!< ICEDGE (Bit 25)                                       */
#define PROTIMER_CC0_CTRL_ICEDGE_Msk      (0x6000000UL)             /*!< ICEDGE (Bitfield-Mask: 0x03)                          */
/* ========================================================  CC0_PRE  ======================================================== */
#define PROTIMER_CC0_PRE_PRE_Pos          (0UL)                     /*!< PRE (Bit 0)                                           */
#define PROTIMER_CC0_PRE_PRE_Msk          (0xffffUL)                /*!< PRE (Bitfield-Mask: 0xffff)                           */
/* =======================================================  CC0_BASE  ======================================================== */
#define PROTIMER_CC0_BASE_BASE_Pos        (0UL)                     /*!< BASE (Bit 0)                                          */
#define PROTIMER_CC0_BASE_BASE_Msk        (0xffffUL)                /*!< BASE (Bitfield-Mask: 0xffff)                          */
/* =======================================================  CC0_WRAP  ======================================================== */
#define PROTIMER_CC0_WRAP_WRAP_Pos        (0UL)                     /*!< WRAP (Bit 0)                                          */
#define PROTIMER_CC0_WRAP_WRAP_Msk        (0xffffffffUL)            /*!< WRAP (Bitfield-Mask: 0xffffffff)                      */
/* =======================================================  CC1_CTRL  ======================================================== */
#define PROTIMER_CC1_CTRL_ENABLE_Pos      (0UL)                     /*!< ENABLE (Bit 0)                                        */
#define PROTIMER_CC1_CTRL_ENABLE_Msk      (0x1UL)                   /*!< ENABLE (Bitfield-Mask: 0x01)                          */
#define PROTIMER_CC1_CTRL_CCMODE_Pos      (1UL)                     /*!< CCMODE (Bit 1)                                        */
#define PROTIMER_CC1_CTRL_CCMODE_Msk      (0x2UL)                   /*!< CCMODE (Bitfield-Mask: 0x01)                          */
#define PROTIMER_CC1_CTRL_PREMATCHEN_Pos  (2UL)                     /*!< PREMATCHEN (Bit 2)                                    */
#define PROTIMER_CC1_CTRL_PREMATCHEN_Msk  (0x4UL)                   /*!< PREMATCHEN (Bitfield-Mask: 0x01)                      */
#define PROTIMER_CC1_CTRL_BASEMATCHEN_Pos (3UL)                     /*!< BASEMATCHEN (Bit 3)                                   */
#define PROTIMER_CC1_CTRL_BASEMATCHEN_Msk (0x8UL)                   /*!< BASEMATCHEN (Bitfield-Mask: 0x01)                     */
#define PROTIMER_CC1_CTRL_WRAPMATCHEN_Pos (4UL)                     /*!< WRAPMATCHEN (Bit 4)                                   */
#define PROTIMER_CC1_CTRL_WRAPMATCHEN_Msk (0x10UL)                  /*!< WRAPMATCHEN (Bitfield-Mask: 0x01)                     */
#define PROTIMER_CC1_CTRL_OIST_Pos        (5UL)                     /*!< OIST (Bit 5)                                          */
#define PROTIMER_CC1_CTRL_OIST_Msk        (0x20UL)                  /*!< OIST (Bitfield-Mask: 0x01)                            */
#define PROTIMER_CC1_CTRL_OUTINV_Pos      (6UL)                     /*!< OUTINV (Bit 6)                                        */
#define PROTIMER_CC1_CTRL_OUTINV_Msk      (0x40UL)                  /*!< OUTINV (Bitfield-Mask: 0x01)                          */
#define PROTIMER_CC1_CTRL_MOA_Pos         (8UL)                     /*!< MOA (Bit 8)                                           */
#define PROTIMER_CC1_CTRL_MOA_Msk         (0x300UL)                 /*!< MOA (Bitfield-Mask: 0x03)                             */
#define PROTIMER_CC1_CTRL_OFOA_Pos        (10UL)                    /*!< OFOA (Bit 10)                                         */
#define PROTIMER_CC1_CTRL_OFOA_Msk        (0xc00UL)                 /*!< OFOA (Bitfield-Mask: 0x03)                            */
#define PROTIMER_CC1_CTRL_OFSEL_Pos       (12UL)                    /*!< OFSEL (Bit 12)                                        */
#define PROTIMER_CC1_CTRL_OFSEL_Msk       (0x3000UL)                /*!< OFSEL (Bitfield-Mask: 0x03)                           */
#define PROTIMER_CC1_CTRL_PRSCONF_Pos     (14UL)                    /*!< PRSCONF (Bit 14)                                      */
#define PROTIMER_CC1_CTRL_PRSCONF_Msk     (0x4000UL)                /*!< PRSCONF (Bitfield-Mask: 0x01)                         */
#define PROTIMER_CC1_CTRL_INSEL_Pos       (21UL)                    /*!< INSEL (Bit 21)                                        */
#define PROTIMER_CC1_CTRL_INSEL_Msk       (0x1e00000UL)             /*!< INSEL (Bitfield-Mask: 0x0f)                           */
#define PROTIMER_CC1_CTRL_ICEDGE_Pos      (25UL)                    /*!< ICEDGE (Bit 25)                                       */
#define PROTIMER_CC1_CTRL_ICEDGE_Msk      (0x6000000UL)             /*!< ICEDGE (Bitfield-Mask: 0x03)                          */
/* ========================================================  CC1_PRE  ======================================================== */
#define PROTIMER_CC1_PRE_PRE_Pos          (0UL)                     /*!< PRE (Bit 0)                                           */
#define PROTIMER_CC1_PRE_PRE_Msk          (0xffffUL)                /*!< PRE (Bitfield-Mask: 0xffff)                           */
/* =======================================================  CC1_BASE  ======================================================== */
#define PROTIMER_CC1_BASE_BASE_Pos        (0UL)                     /*!< BASE (Bit 0)                                          */
#define PROTIMER_CC1_BASE_BASE_Msk        (0xffffUL)                /*!< BASE (Bitfield-Mask: 0xffff)                          */
/* =======================================================  CC1_WRAP  ======================================================== */
#define PROTIMER_CC1_WRAP_WRAP_Pos        (0UL)                     /*!< WRAP (Bit 0)                                          */
#define PROTIMER_CC1_WRAP_WRAP_Msk        (0xffffffffUL)            /*!< WRAP (Bitfield-Mask: 0xffffffff)                      */
/* =======================================================  CC2_CTRL  ======================================================== */
#define PROTIMER_CC2_CTRL_ENABLE_Pos      (0UL)                     /*!< ENABLE (Bit 0)                                        */
#define PROTIMER_CC2_CTRL_ENABLE_Msk      (0x1UL)                   /*!< ENABLE (Bitfield-Mask: 0x01)                          */
#define PROTIMER_CC2_CTRL_CCMODE_Pos      (1UL)                     /*!< CCMODE (Bit 1)                                        */
#define PROTIMER_CC2_CTRL_CCMODE_Msk      (0x2UL)                   /*!< CCMODE (Bitfield-Mask: 0x01)                          */
#define PROTIMER_CC2_CTRL_PREMATCHEN_Pos  (2UL)                     /*!< PREMATCHEN (Bit 2)                                    */
#define PROTIMER_CC2_CTRL_PREMATCHEN_Msk  (0x4UL)                   /*!< PREMATCHEN (Bitfield-Mask: 0x01)                      */
#define PROTIMER_CC2_CTRL_BASEMATCHEN_Pos (3UL)                     /*!< BASEMATCHEN (Bit 3)                                   */
#define PROTIMER_CC2_CTRL_BASEMATCHEN_Msk (0x8UL)                   /*!< BASEMATCHEN (Bitfield-Mask: 0x01)                     */
#define PROTIMER_CC2_CTRL_WRAPMATCHEN_Pos (4UL)                     /*!< WRAPMATCHEN (Bit 4)                                   */
#define PROTIMER_CC2_CTRL_WRAPMATCHEN_Msk (0x10UL)                  /*!< WRAPMATCHEN (Bitfield-Mask: 0x01)                     */
#define PROTIMER_CC2_CTRL_OIST_Pos        (5UL)                     /*!< OIST (Bit 5)                                          */
#define PROTIMER_CC2_CTRL_OIST_Msk        (0x20UL)                  /*!< OIST (Bitfield-Mask: 0x01)                            */
#define PROTIMER_CC2_CTRL_OUTINV_Pos      (6UL)                     /*!< OUTINV (Bit 6)                                        */
#define PROTIMER_CC2_CTRL_OUTINV_Msk      (0x40UL)                  /*!< OUTINV (Bitfield-Mask: 0x01)                          */
#define PROTIMER_CC2_CTRL_MOA_Pos         (8UL)                     /*!< MOA (Bit 8)                                           */
#define PROTIMER_CC2_CTRL_MOA_Msk         (0x300UL)                 /*!< MOA (Bitfield-Mask: 0x03)                             */
#define PROTIMER_CC2_CTRL_OFOA_Pos        (10UL)                    /*!< OFOA (Bit 10)                                         */
#define PROTIMER_CC2_CTRL_OFOA_Msk        (0xc00UL)                 /*!< OFOA (Bitfield-Mask: 0x03)                            */
#define PROTIMER_CC2_CTRL_OFSEL_Pos       (12UL)                    /*!< OFSEL (Bit 12)                                        */
#define PROTIMER_CC2_CTRL_OFSEL_Msk       (0x3000UL)                /*!< OFSEL (Bitfield-Mask: 0x03)                           */
#define PROTIMER_CC2_CTRL_PRSCONF_Pos     (14UL)                    /*!< PRSCONF (Bit 14)                                      */
#define PROTIMER_CC2_CTRL_PRSCONF_Msk     (0x4000UL)                /*!< PRSCONF (Bitfield-Mask: 0x01)                         */
#define PROTIMER_CC2_CTRL_INSEL_Pos       (21UL)                    /*!< INSEL (Bit 21)                                        */
#define PROTIMER_CC2_CTRL_INSEL_Msk       (0x1e00000UL)             /*!< INSEL (Bitfield-Mask: 0x0f)                           */
#define PROTIMER_CC2_CTRL_ICEDGE_Pos      (25UL)                    /*!< ICEDGE (Bit 25)                                       */
#define PROTIMER_CC2_CTRL_ICEDGE_Msk      (0x6000000UL)             /*!< ICEDGE (Bitfield-Mask: 0x03)                          */
/* ========================================================  CC2_PRE  ======================================================== */
#define PROTIMER_CC2_PRE_PRE_Pos          (0UL)                     /*!< PRE (Bit 0)                                           */
#define PROTIMER_CC2_PRE_PRE_Msk          (0xffffUL)                /*!< PRE (Bitfield-Mask: 0xffff)                           */
/* =======================================================  CC2_BASE  ======================================================== */
#define PROTIMER_CC2_BASE_BASE_Pos        (0UL)                     /*!< BASE (Bit 0)                                          */
#define PROTIMER_CC2_BASE_BASE_Msk        (0xffffUL)                /*!< BASE (Bitfield-Mask: 0xffff)                          */
/* =======================================================  CC2_WRAP  ======================================================== */
#define PROTIMER_CC2_WRAP_WRAP_Pos        (0UL)                     /*!< WRAP (Bit 0)                                          */
#define PROTIMER_CC2_WRAP_WRAP_Msk        (0xffffffffUL)            /*!< WRAP (Bitfield-Mask: 0xffffffff)                      */
/* =======================================================  CC3_CTRL  ======================================================== */
#define PROTIMER_CC3_CTRL_ENABLE_Pos      (0UL)                     /*!< ENABLE (Bit 0)                                        */
#define PROTIMER_CC3_CTRL_ENABLE_Msk      (0x1UL)                   /*!< ENABLE (Bitfield-Mask: 0x01)                          */
#define PROTIMER_CC3_CTRL_CCMODE_Pos      (1UL)                     /*!< CCMODE (Bit 1)                                        */
#define PROTIMER_CC3_CTRL_CCMODE_Msk      (0x2UL)                   /*!< CCMODE (Bitfield-Mask: 0x01)                          */
#define PROTIMER_CC3_CTRL_PREMATCHEN_Pos  (2UL)                     /*!< PREMATCHEN (Bit 2)                                    */
#define PROTIMER_CC3_CTRL_PREMATCHEN_Msk  (0x4UL)                   /*!< PREMATCHEN (Bitfield-Mask: 0x01)                      */
#define PROTIMER_CC3_CTRL_BASEMATCHEN_Pos (3UL)                     /*!< BASEMATCHEN (Bit 3)                                   */
#define PROTIMER_CC3_CTRL_BASEMATCHEN_Msk (0x8UL)                   /*!< BASEMATCHEN (Bitfield-Mask: 0x01)                     */
#define PROTIMER_CC3_CTRL_WRAPMATCHEN_Pos (4UL)                     /*!< WRAPMATCHEN (Bit 4)                                   */
#define PROTIMER_CC3_CTRL_WRAPMATCHEN_Msk (0x10UL)                  /*!< WRAPMATCHEN (Bitfield-Mask: 0x01)                     */
#define PROTIMER_CC3_CTRL_OIST_Pos        (5UL)                     /*!< OIST (Bit 5)                                          */
#define PROTIMER_CC3_CTRL_OIST_Msk        (0x20UL)                  /*!< OIST (Bitfield-Mask: 0x01)                            */
#define PROTIMER_CC3_CTRL_OUTINV_Pos      (6UL)                     /*!< OUTINV (Bit 6)                                        */
#define PROTIMER_CC3_CTRL_OUTINV_Msk      (0x40UL)                  /*!< OUTINV (Bitfield-Mask: 0x01)                          */
