VDowbensky/efr32_baremetal/baremetal_test/device/efr32fg1v_protimer.h
#define PROTIMER_CC3_CTRL_MOA_Pos         (8UL)                     /*!< MOA (Bit 8)                                           */
#define PROTIMER_CC3_CTRL_MOA_Msk         (0x300UL)                 /*!< MOA (Bitfield-Mask: 0x03)                             */
#define PROTIMER_CC3_CTRL_OFOA_Pos        (10UL)                    /*!< OFOA (Bit 10)                                         */
#define PROTIMER_CC3_CTRL_OFOA_Msk        (0xc00UL)                 /*!< OFOA (Bitfield-Mask: 0x03)                            */
#define PROTIMER_CC3_CTRL_OFSEL_Pos       (12UL)                    /*!< OFSEL (Bit 12)                                        */
#define PROTIMER_CC3_CTRL_OFSEL_Msk       (0x3000UL)                /*!< OFSEL (Bitfield-Mask: 0x03)                           */
#define PROTIMER_CC3_CTRL_PRSCONF_Pos     (14UL)                    /*!< PRSCONF (Bit 14)                                      */
#define PROTIMER_CC3_CTRL_PRSCONF_Msk     (0x4000UL)                /*!< PRSCONF (Bitfield-Mask: 0x01)                         */
#define PROTIMER_CC3_CTRL_INSEL_Pos       (21UL)                    /*!< INSEL (Bit 21)                                        */
#define PROTIMER_CC3_CTRL_INSEL_Msk       (0x1e00000UL)             /*!< INSEL (Bitfield-Mask: 0x0f)                           */
#define PROTIMER_CC3_CTRL_ICEDGE_Pos      (25UL)                    /*!< ICEDGE (Bit 25)                                       */
#define PROTIMER_CC3_CTRL_ICEDGE_Msk      (0x6000000UL)             /*!< ICEDGE (Bitfield-Mask: 0x03)                          */
/* ========================================================  CC3_PRE  ======================================================== */
#define PROTIMER_CC3_PRE_PRE_Pos          (0UL)                     /*!< PRE (Bit 0)                                           */
#define PROTIMER_CC3_PRE_PRE_Msk          (0xffffUL)                /*!< PRE (Bitfield-Mask: 0xffff)                           */
/* =======================================================  CC3_BASE  ======================================================== */
#define PROTIMER_CC3_BASE_BASE_Pos        (0UL)                     /*!< BASE (Bit 0)                                          */
#define PROTIMER_CC3_BASE_BASE_Msk        (0xffffUL)                /*!< BASE (Bitfield-Mask: 0xffff)                          */
/* =======================================================  CC3_WRAP  ======================================================== */
#define PROTIMER_CC3_WRAP_WRAP_Pos        (0UL)                     /*!< WRAP (Bit 0)                                          */
#define PROTIMER_CC3_WRAP_WRAP_Msk        (0xffffffffUL)            /*!< WRAP (Bitfield-Mask: 0xffffffff)                      */
/* =======================================================  CC4_CTRL  ======================================================== */
#define PROTIMER_CC4_CTRL_ENABLE_Pos      (0UL)                     /*!< ENABLE (Bit 0)                                        */
#define PROTIMER_CC4_CTRL_ENABLE_Msk      (0x1UL)                   /*!< ENABLE (Bitfield-Mask: 0x01)                          */
#define PROTIMER_CC4_CTRL_CCMODE_Pos      (1UL)                     /*!< CCMODE (Bit 1)                                        */
#define PROTIMER_CC4_CTRL_CCMODE_Msk      (0x2UL)                   /*!< CCMODE (Bitfield-Mask: 0x01)                          */
#define PROTIMER_CC4_CTRL_PREMATCHEN_Pos  (2UL)                     /*!< PREMATCHEN (Bit 2)                                    */
#define PROTIMER_CC4_CTRL_PREMATCHEN_Msk  (0x4UL)                   /*!< PREMATCHEN (Bitfield-Mask: 0x01)                      */
#define PROTIMER_CC4_CTRL_BASEMATCHEN_Pos (3UL)                     /*!< BASEMATCHEN (Bit 3)                                   */
#define PROTIMER_CC4_CTRL_BASEMATCHEN_Msk (0x8UL)                   /*!< BASEMATCHEN (Bitfield-Mask: 0x01)                     */
#define PROTIMER_CC4_CTRL_WRAPMATCHEN_Pos (4UL)                     /*!< WRAPMATCHEN (Bit 4)                                   */
#define PROTIMER_CC4_CTRL_WRAPMATCHEN_Msk (0x10UL)                  /*!< WRAPMATCHEN (Bitfield-Mask: 0x01)                     */
#define PROTIMER_CC4_CTRL_OIST_Pos        (5UL)                     /*!< OIST (Bit 5)                                          */
#define PROTIMER_CC4_CTRL_OIST_Msk        (0x20UL)                  /*!< OIST (Bitfield-Mask: 0x01)                            */
#define PROTIMER_CC4_CTRL_OUTINV_Pos      (6UL)                     /*!< OUTINV (Bit 6)                                        */
#define PROTIMER_CC4_CTRL_OUTINV_Msk      (0x40UL)                  /*!< OUTINV (Bitfield-Mask: 0x01)                          */
#define PROTIMER_CC4_CTRL_MOA_Pos         (8UL)                     /*!< MOA (Bit 8)                                           */
#define PROTIMER_CC4_CTRL_MOA_Msk         (0x300UL)                 /*!< MOA (Bitfield-Mask: 0x03)                             */
#define PROTIMER_CC4_CTRL_OFOA_Pos        (10UL)                    /*!< OFOA (Bit 10)                                         */
#define PROTIMER_CC4_CTRL_OFOA_Msk        (0xc00UL)                 /*!< OFOA (Bitfield-Mask: 0x03)                            */
#define PROTIMER_CC4_CTRL_OFSEL_Pos       (12UL)                    /*!< OFSEL (Bit 12)                                        */
#define PROTIMER_CC4_CTRL_OFSEL_Msk       (0x3000UL)                /*!< OFSEL (Bitfield-Mask: 0x03)                           */
#define PROTIMER_CC4_CTRL_PRSCONF_Pos     (14UL)                    /*!< PRSCONF (Bit 14)                                      */
#define PROTIMER_CC4_CTRL_PRSCONF_Msk     (0x4000UL)                /*!< PRSCONF (Bitfield-Mask: 0x01)                         */
#define PROTIMER_CC4_CTRL_INSEL_Pos       (21UL)                    /*!< INSEL (Bit 21)                                        */
#define PROTIMER_CC4_CTRL_INSEL_Msk       (0x1e00000UL)             /*!< INSEL (Bitfield-Mask: 0x0f)                           */
#define PROTIMER_CC4_CTRL_ICEDGE_Pos      (25UL)                    /*!< ICEDGE (Bit 25)                                       */
#define PROTIMER_CC4_CTRL_ICEDGE_Msk      (0x6000000UL)             /*!< ICEDGE (Bitfield-Mask: 0x03)                          */
/* ========================================================  CC4_PRE  ======================================================== */
#define PROTIMER_CC4_PRE_PRE_Pos          (0UL)                     /*!< PRE (Bit 0)                                           */
#define PROTIMER_CC4_PRE_PRE_Msk          (0xffffUL)                /*!< PRE (Bitfield-Mask: 0xffff)                           */
/* =======================================================  CC4_BASE  ======================================================== */
#define PROTIMER_CC4_BASE_BASE_Pos        (0UL)                     /*!< BASE (Bit 0)                                          */
#define PROTIMER_CC4_BASE_BASE_Msk        (0xffffUL)                /*!< BASE (Bitfield-Mask: 0xffff)                          */
/* =======================================================  CC4_WRAP  ======================================================== */
#define PROTIMER_CC4_WRAP_WRAP_Pos        (0UL)                     /*!< WRAP (Bit 0)                                          */
#define PROTIMER_CC4_WRAP_WRAP_Msk        (0xffffffffUL)            /*!< WRAP (Bitfield-Mask: 0xffffffff)                      */

/** @} */
/** @} End of group EFR32FG1V_PROTIMER*/
/** @} End of group Parts */
